# MULTIPLE LINEAR REGRESSION

In [6]:
import pandas as pd #LOAD THE NECESSARY LIBRARIES 
import matplotlib.pyplot as plt
from sklearn.linear_model import LinearRegression

In [11]:
df=pd.read_csv(r"/users/pawarbharath/downloads/MULLIN/hiring.csv")

In [13]:
df.head(3)

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000

# project discription

based on exp /test_score(out of 10)/interview_score(out of 10),predict salary ($)

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 4 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   experience                  6 non-null      object
 1   test_score(out of 10)       7 non-null      float64
 2   interview_score(out of 10)  8 non-null      int64
 3   salary($)                   8 non-null      int64
dtypes: float64(1), int64(2), object(1)
memory usage: 384.0+ bytes

In [15]:
df.head(5)

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000

In [17]:
df['experience']=df['experience'].fillna('zero') #fill null values with zero and replace colummn with filled values

In [18]:
df.head(5)

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0       zero                    8.0                           9      50000
1       zero                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000

In [19]:
pip install word2number

Defaulting to user installation because normal site-packages is not writeable
Collecting word2number
  Downloading word2number-1.1.zip (9.7 kB)
Building wheels for collected packages: word2number
  Building wheel for word2number (setup.py) ... done
  Created wheel for word2number: filename=word2number-1.1-py3-none-any.whl size=5586 sha256=dc77cab1b80fff20372ef37523cbc5eb7e721a9ac4705557b9c6355eb98e6ecf
  Stored in directory: /Users/pawarbharath/Library/Caches/pip/wheels/cb/f3/5a/d88198fdeb46781ddd7e7f2653061af83e7adb2a076d8886d6
Successfully built word2number
Installing collected packages: word2number
Successfully installed word2number-1.1
Note: you may need to restart the kernel to use updated packages.

In [20]:
from word2number import w2n

In [21]:
df['experience']=df['experience'].apply(w2n.word_to_num)#word to num library to convert word to. num

In [22]:
df.head(3)

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                    8.0                           9      50000
1           0                    8.0                           6      45000
2           5                    6.0                           7      60000

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 4 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   experience                  8 non-null      int64
 1   test_score(out of 10)       7 non-null      float64
 2   interview_score(out of 10)  8 non-null      int64
 3   salary($)                   8 non-null      int64
dtypes: float64(1), int64(3)
memory usage: 384.0 bytes

In [31]:
import math
meanscore=math.floor(df['test_score(out of 10)'].mean())

In [42]:
meanscore

7

In [32]:
df['test_score(out of 10)']=df['test_score(out of 10)'].fillna(meanscore)

In [33]:
df.head(5)

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                    8.0                           9      50000
1           0                    8.0                           6      45000
2           5                    6.0                           7      60000
3           2                   10.0                          10      65000
4           7                    9.0                           6      70000

In [30]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 4 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   experience                  8 non-null      int64
 1   test_score(out of 10)       8 non-null      float64
 2   interview_score(out of 10)  8 non-null      int64
 3   salary($)                   8 non-null      int64
dtypes: float64(1), int64(3)
memory usage: 384.0 bytes

In [35]:
df.isnull().sum()

experience                    0
test_score(out of 10)         0
interview_score(out of 10)    0
salary($)                     0
dtype: int64

In [37]:
df.columns

Index(['experience', 'test_score(out of 10)', 'interview_score(out of 10)',
       'salary($)'],
      dtype='object')

In [38]:
x=df[['experience', 'test_score(out of 10)', 'interview_score(out of 10)']]#give x as fetures to fit the values

In [39]:
y=df[['salary($)']]#give the target variable

In [40]:
mrg=LinearRegression() #storing the linear regression in the mrg

In [41]:
mrg.fit(x,y)

LinearRegression()

In [43]:
df.head(2)

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                    8.0                           9      50000
1           0                    8.0                           6      45000

In [48]:
mrg.predict([[1,8,7]]) #it is predicting the salary when we give exp ,test_score,interview_score

array([[50747.29579988]])

In [45]:
mrg.score(x,y)

0.9639958361860578

In [46]:
mrg.coef_

array([[2827.63404314, 1912.93803053, 2196.9753141 ]])

In [47]:
mrg.intercept_

array([17237.33031373])

# y=mx+b
y=m1x1+m2x2+m3x3+b
2827.63(1)+1912.93(8)+2196.97(7)+17237

In [ ]:
from sklearn.metrics import accuracy_score
regresssion_model_sklearn_accuracy = mrg.score(X,y)
regresssion_model_sklearn_accuracy